#pragma once
#include "_i18n_.h"

namespace i18n {

	// cn
	static constexpr std::u32string_view TextsCN[]{
		U"游戏名",
		U"语言",
		U"中文",
		U"英文",
		U"关闭",
		U"开始游戏",
		U"设置",
		U"退出",
		U"窗口模式",
		U"全屏模式 (无边框)",
		U"全屏模式 (独占)",
		U"静音",
		U"总音量",
		U"音效音量",
		U"音乐音量",
		U"[ESC] 返回",
		U"[SPACE] 确定",

		U"血量上限",
		U"血量再生",
		U"法力上限",
		U"法力再生",
		U"防御值",
		U"闪避值",
		U"伤害倍率",
		U"暴击概率",
		U"暴击倍率",
		U"移动速度",
		U"幸运值",
		U"收获值",

		U"普通",
		U"优质",
		U"稀有",
		U"史诗",
		U"传说",
		U"远古",
		U"神话",

		U"头盔",
		U"戒指",
		U"饰品",
		U"盔甲",
		U"主武器",
		U"副武器",
		U"靴子",
		U"货币",
		U"材料",
		U"消耗品",

		U"红宝石项链",
		U"黄金甲",
		U"钢甲",
		U"法师甲",
		U"皮靴",
		U"魔药",
		U"银币",
		U"红宝石",
		U"钢盔",
		U"木材",
		U"琉璃戒指",
		U"银戒指",
		U"蓝宝石戒指",
		U"骷髅头戒指",
		U"铁剑",
		U"木弓",
		U"法杖",
		U"木盾",

		// ...
	};

}
